In [1]:
import pandas as pd

In [2]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [3]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [4]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [5]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [6]:
df_one['col2'].value_counts()

WA    2
NV    1
AK    1
CA    1
NY    1
Name: col2, dtype: int64

In [7]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [8]:
def grab_first_letter(state):
    return state[0]

In [9]:
df_one['first_letter'] = df_one['col2'].apply(grab_first_letter)
df_one

  k1  col1 col2 first_letter
0  A   100   NY            N
1  A   200   CA            C
2  B   300   WA            W
3  B   300   WA            W
4  C   400   AK            A
5  C   500   NV            N

In [10]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [11]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [12]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [13]:
my_map = {'A':1, 'B':2, 'C':3}
df_one['num'] = df_one['k1'].map(my_map)

In [14]:
df_one['col1'].max()

500

In [15]:
df_one['col1'].idxmax()

5

In [16]:
df_one['col1'].min()

100

In [18]:
df_one.columns = ['C1', 'C2', 'C3', 'C4', 'C5']
df_one

  C1   C2  C3 C4  C5
0  A  100  NY  N   1
1  A  200  CA  C   1
2  B  300  WA  W   2
3  B  300  WA  W   2
4  C  400  AK  A   3
5  C  500  NV  N   3

In [19]:
df_one.sort_values('C3')

  C1   C2  C3 C4  C5
4  C  400  AK  A   3
1  A  200  CA  C   1
5  C  500  NV  N   3
0  A  100  NY  N   1
2  B  300  WA  W   2
3  B  300  WA  W   2

In [20]:
pd.concat([df_one, df_one])

  C1   C2  C3 C4  C5
0  A  100  NY  N   1
1  A  200  CA  C   1
2  B  300  WA  W   2
3  B  300  WA  W   2
4  C  400  AK  A   3
5  C  500  NV  N   3
0  A  100  NY  N   1
1  A  200  CA  C   1
2  B  300  WA  W   2
3  B  300  WA  W   2
4  C  400  AK  A   3
5  C  500  NV  N   3

In [21]:
pd.concat([df_one, df_one], axis=1)

  C1   C2  C3 C4  C5 C1   C2  C3 C4  C5
0  A  100  NY  N   1  A  100  NY  N   1
1  A  200  CA  C   1  A  200  CA  C   1
2  B  300  WA  W   2  B  300  WA  W   2
3  B  300  WA  W   2  B  300  WA  W   2
4  C  400  AK  A   3  C  400  AK  A   3
5  C  500  NV  N   3  C  500  NV  N   3

In [22]:
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1